9/data/attachments/cbe0477582d62b2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_c830943d-530c-4cd1-ac17-fa57ba46da67</nif:username>
            <nif:friendToBeAdded>Jamie_finally_Actions_6101_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>